package com.atguigu.java;

/*
 * Eclipse中的快捷键：
 * 1.补全代码的声明：
 * 2.快速修复: 
 * 3.批量导包：
 * 4.使用单行注释：
 * 5.使用多行注释：  
 * 6.取消多行注释：
 * 7.复制指定行的代码：  或 
 * 8.删除指定行的代码：
 * 9.上下移动代码：  或 
 * 10.切换到下一行代码空位：
 * 11.切换到上一行代码空位：
 * 12.如何查看源码：   或  
 * 13.退回到前一个编辑的页面：
 * 14.进入到下一个编辑的页面(针对于上面那条来说的)：
 * 15.光标选中指定的类，查看继承树结构：
 * 16.复制代码： 
 * 17.撤销：
 * 18.反撤销： 
 * 19.剪切： 
 * 20.粘贴：
 * 21.保存： 
 * 22.全选：
 * 23.格式化代码： 
 * 24.选中数行，整体往后移动：
 * 25.选中数行，整体往前移动：
 * 26.在当前类中，显示类结构，并支持搜索指定的方法、属性等：
 * 27.批量修改指定的变量名、方法名、类名等：
 * 28.选中的结构的大小写的切换：变成大写：  
 * 29.选中的结构的大小写的切换：变成小写：
 * 30.调出生成getter/setter/构造器等结构： 
 * 31.显示当前选择资源(工程 or 文件)的属性：
 * 32.快速查找：参照选中的Word快速定位到下一个:
 * 
 * 33.关闭当前窗口：
 * 34.关闭所有的窗口：
 * 35.查看指定的结构使用过的地方：
 * 36.查找与替换：
 * 37.最大化当前的View：
 * 38.直接定位到当前行的首位：
 * 39.直接定位到当前行的末位：
 */

public class EclipseKeysBlank {

	
}
